; domain
(define (domain emergencias)
    (:requirements :strips :typing)
    (:types
        location box bcontent grip person dron - object
    )

    (:predicates
        (at-dron ?d - dron ?l - location) 
        (at-box ?b - box ?l - location)
        (at-person ?p - person ?l - location)
        
        (box-has ?b - box ?c - bcontent)
        (person-has ?p - person ?c - bcontent)
        
        (free ?g - grip)
        (carrying ?d - dron ?g - grip ?b - box)
    )


    (:action move
        :parameters (?from - location ?to - location ?dron - dron)
        :precondition (at-dron ?dron ?from)
        :effect (and (at-dron ?dron ?to)(not(at-dron ?dron ?from)))
    )

    (:action pick
        :parameters (?box - box ?location - location ?gripper - grip ?dron - dron)
        :precondition (and (at-dron ?dron ?location)(at-box ?box ?location)(free ?gripper))
        :effect (and (not (at-box ?box ?location))(not (free ?gripper))(carrying ?dron ?gripper ?box))
    )

    (:action leave
        :parameters (?box - box ?location - location ?gripper - grip ?dron - dron ?person - person ?content - bcontent)
        :precondition (and (at-dron ?dron ?location)(carrying ?dron ?gripper ?box)(at-person ?person ?location)(box-has ?box ?content))
        :effect (and (at-box ?box ?location)(free ?gripper)(not(carrying ?dron ?gripper ?box))(person-has ?person ?content)(not(box-has ?box ?content)))
    )
)

; problem
(define (problem drone_problem_d1_l32_p32_c32_g32)
(:domain emergencias)
(:objects
	dron1 - dron
	deposito refugio1 refugio2 refugio3 refugio4 refugio5 refugio6 refugio7 refugio8 refugio9 refugio10 refugio11 refugio12 refugio13 refugio14 refugio15 refugio16 refugio17 refugio18 refugio19 refugio20 refugio21 refugio22 refugio23 refugio24 refugio25 refugio26 refugio27 refugio28 refugio29 refugio30 refugio31 refugio32 - location
	box1 box2 box3 box4 box5 box6 box7 box8 box9 box10 box11 box12 box13 box14 box15 box16 box17 box18 box19 box20 box21 box22 box23 box24 box25 box26 box27 box28 box29 box30 box31 box32 - box
	comida medicina - bcontent
	person1 person2 person3 person4 person5 person6 person7 person8 person9 person10 person11 person12 person13 person14 person15 person16 person17 person18 person19 person20 person21 person22 person23 person24 person25 person26 person27 person28 person29 person30 person31 person32 - person
	dron1-izq dron1-der - grip
)

(:init
	(at-dron dron1 deposito)
	(free dron1-izq)
	(free dron1-der)
	(at-box box1 deposito)
	(box-has box1 comida)
	(at-box box2 deposito)
	(box-has box2 comida)
	(at-box box3 deposito)
	(box-has box3 comida)
	(at-box box4 deposito)
	(box-has box4 comida)
	(at-box box5 deposito)
	(box-has box5 comida)
	(at-box box6 deposito)
	(box-has box6 comida)
	(at-box box7 deposito)
	(box-has box7 comida)
	(at-box box8 deposito)
	(box-has box8 comida)
	(at-box box9 deposito)
	(box-has box9 comida)
	(at-box box10 deposito)
	(box-has box10 comida)
	(at-box box11 deposito)
	(box-has box11 comida)
	(at-box box12 deposito)
	(box-has box12 comida)
	(at-box box13 deposito)
	(box-has box13 comida)
	(at-box box14 deposito)
	(box-has box14 comida)
	(at-box box15 deposito)
	(box-has box15 comida)
	(at-box box16 deposito)
	(box-has box16 comida)
	(at-box box17 deposito)
	(box-has box17 comida)
	(at-box box18 deposito)
	(box-has box18 comida)
	(at-box box19 deposito)
	(box-has box19 comida)
	(at-box box20 deposito)
	(box-has box20 medicina)
	(at-box box21 deposito)
	(box-has box21 medicina)
	(at-box box22 deposito)
	(box-has box22 medicina)
	(at-box box23 deposito)
	(box-has box23 medicina)
	(at-box box24 deposito)
	(box-has box24 medicina)
	(at-box box25 deposito)
	(box-has box25 medicina)
	(at-box box26 deposito)
	(box-has box26 medicina)
	(at-box box27 deposito)
	(box-has box27 medicina)
	(at-box box28 deposito)
	(box-has box28 medicina)
	(at-box box29 deposito)
	(box-has box29 medicina)
	(at-box box30 deposito)
	(box-has box30 medicina)
	(at-box box31 deposito)
	(box-has box31 medicina)
	(at-box box32 deposito)
	(box-has box32 medicina)
	(at-person person1 refugio22)
	(at-person person2 refugio8)
	(at-person person3 refugio22)
	(at-person person4 refugio30)
	(at-person person5 refugio12)
	(at-person person6 refugio9)
	(at-person person7 refugio2)
	(at-person person8 refugio10)
	(at-person person9 refugio8)
	(at-person person10 refugio18)
	(at-person person11 refugio28)
	(at-person person12 refugio2)
	(at-person person13 refugio7)
	(at-person person14 refugio14)
	(at-person person15 refugio32)
	(at-person person16 refugio19)
	(at-person person17 refugio15)
	(at-person person18 refugio12)
	(at-person person19 refugio22)
	(at-person person20 refugio24)
	(at-person person21 refugio9)
	(at-person person22 refugio11)
	(at-person person23 refugio20)
	(at-person person24 refugio16)
	(at-person person25 refugio5)
	(at-person person26 refugio12)
	(at-person person27 refugio3)
	(at-person person28 refugio10)
	(at-person person29 refugio6)
	(at-person person30 refugio1)
	(at-person person31 refugio16)
	(at-person person32 refugio14)
)

(:goal (and
	(person-has person2 comida)
	(person-has person2 medicina)
	(person-has person3 comida)
	(person-has person4 comida)
	(person-has person5 comida)
	(person-has person6 comida)
	(person-has person9 comida)
	(person-has person10 comida)
	(person-has person11 comida)
	(person-has person12 medicina)
	(person-has person13 comida)
	(person-has person13 medicina)
	(person-has person14 comida)
	(person-has person14 medicina)
	(person-has person15 comida)
	(person-has person16 comida)
	(person-has person16 medicina)
	(person-has person17 comida)
	(person-has person18 comida)
	(person-has person19 comida)
	(person-has person19 medicina)
	(person-has person20 medicina)
	(person-has person22 comida)
	(person-has person23 comida)
	(person-has person23 medicina)
	(person-has person24 comida)
	(person-has person24 medicina)
	(person-has person26 medicina)
	(person-has person28 medicina)
	(person-has person30 medicina)
	(person-has person31 comida)
	(person-has person31 medicina)
))
)

; plan
1. (pick box19 deposito dron1-der dron1)
   deleted: (at-box box19 deposito) (free dron1-der)
   added: (carrying dron1 dron1-der box19)
   goals met: 0 of 32
2. (pick box32 deposito dron1-izq dron1)
   deleted: (at-box box32 deposito) (free dron1-izq)
   added: (carrying dron1 dron1-izq box32)
   goals met: 0 of 32
3. (move deposito refugio30 dron1)
   deleted: (at-dron dron1 deposito)
   added: (at-dron dron1 refugio30)
   goals met: 0 of 32
4. (leave box19 refugio30 dron1-der dron1 person4 comida)
   deleted: (carrying dron1 dron1-der box19) (box-has box19 comida)
   added: (at-box box19 refugio30) (free dron1-der) (person-has person4 comida)
   goals met: 1 of 32
5. (move refugio30 deposito dron1)
   deleted: (at-dron dron1 refugio30)
   added: (at-dron dron1 deposito)
   goals met: 1 of 32
6. (pick box18 deposito dron1-der dron1)
   deleted: (at-box box18 deposito) (free dron1-der)
   added: (carrying dron1 dron1-der box18)
   goals met: 1 of 32
7. (move deposito refugio9 dron1)
   deleted: (at-dron dron1 deposito)
   added: (at-dron dron1 refugio9)
   goals met: 1 of 32
8. (leave box18 refugio9 dron1-der dron1 person6 comida)
   deleted: (carrying dron1 dron1-der box18) (box-has box18 comida)
   added: (at-box box18 refugio9) (free dron1-der) (person-has person6 comida)
   goals met: 2 of 32
9. (move refugio9 deposito dron1)
   deleted: (at-dron dron1 refugio9)
   added: (at-dron dron1 deposito)
   goals met: 2 of 32
10. (pick box17 deposito dron1-der dron1)
   deleted: (at-box box17 deposito) (free dron1-der)
   added: (carrying dron1 dron1-der box17)
   goals met: 2 of 32
11. (move deposito refugio8 dron1)
   deleted: (at-dron dron1 deposito)
   added: (at-dron dron1 refugio8)
   goals met: 2 of 32
12. (move refugio8 refugio18 dron1)
   deleted: (at-dron dron1 refugio8)
   added: (at-dron dron1 refugio18)
   goals met: 2 of 32
13. (leave box17 refugio18 dron1-der dron1 person10 comida)
   deleted: (carrying dron1 dron1-der box17) (box-has box17 comida)
   added: (at-box box17 refugio18) (free dron1-der) (person-has person10 comida)
   goals met: 3 of 32
14. (move refugio18 deposito dron1)
   deleted: (at-dron dron1 refugio18)
   added: (at-dron dron1 deposito)
   goals met: 3 of 32
15. (pick box16 deposito dron1-der dron1)
   deleted: (at-box box16 deposito) (free dron1-der)
   added: (carrying dron1 dron1-der box16)
   goals met: 3 of 32
16. (move deposito refugio8 dron1)
   deleted: (at-dron dron1 deposito)
   added: (at-dron dron1 refugio8)
   goals met: 3 of 32
17. (move refugio8 refugio28 dron1)
   deleted: (at-dron dron1 refugio8)
   added: (at-dron dron1 refugio28)
   goals met: 3 of 32
18. (leave box16 refugio28 dron1-der dron1 person11 comida)
   deleted: (carrying dron1 dron1-der box16) (box-has box16 comida)
   added: (at-box box16 refugio28) (free dron1-der) (person-has person11 comida)
   goals met: 4 of 32
19. (move refugio28 deposito dron1)
   deleted: (at-dron dron1 refugio28)
   added: (at-dron dron1 deposito)
   goals met: 4 of 32
20. (pick box15 deposito dron1-der dron1)
   deleted: (at-box box15 deposito) (free dron1-der)
   added: (carrying dron1 dron1-der box15)
   goals met: 4 of 32
21. (move deposito refugio8 dron1)
   deleted: (at-dron dron1 deposito)
   added: (at-dron dron1 refugio8)
   goals met: 4 of 32
22. (move refugio8 refugio2 dron1)
   deleted: (at-dron dron1 refugio8)
   added: (at-dron dron1 refugio2)
   goals met: 4 of 32
23. (leave box32 refugio2 dron1-izq dron1 person12 medicina)
   deleted: (carrying dron1 dron1-izq box32) (box-has box32 medicina)
   added: (at-box box32 refugio2) (free dron1-izq) (person-has person12 medicina)
   goals met: 5 of 32
24. (move refugio2 deposito dron1)
   deleted: (at-dron dron1 refugio2)
   added: (at-dron dron1 deposito)
   goals met: 5 of 32
25. (pick box31 deposito dron1-izq dron1)
   deleted: (at-box box31 deposito) (free dron1-izq)
   added: (carrying dron1 dron1-izq box31)
   goals met: 5 of 32
26. (move deposito refugio8 dron1)
   deleted: (at-dron dron1 deposito)
   added: (at-dron dron1 refugio8)
   goals met: 5 of 32
27. (move refugio8 refugio32 dron1)
   deleted: (at-dron dron1 refugio8)
   added: (at-dron dron1 refugio32)
   goals met: 5 of 32
28. (leave box15 refugio32 dron1-der dron1 person15 comida)
   deleted: (carrying dron1 dron1-der box15) (box-has box15 comida)
   added: (at-box box15 refugio32) (free dron1-der) (person-has person15 comida)
   goals met: 6 of 32
29. (move refugio32 deposito dron1)
   deleted: (at-dron dron1 refugio32)
   added: (at-dron dron1 deposito)
   goals met: 6 of 32
30. (pick box14 deposito dron1-der dron1)
   deleted: (at-box box14 deposito) (free dron1-der)
   added: (carrying dron1 dron1-der box14)
   goals met: 6 of 32
31. (move deposito refugio8 dron1)
   deleted: (at-dron dron1 deposito)
   added: (at-dron dron1 refugio8)
   goals met: 6 of 32
32. (move refugio8 refugio15 dron1)
   deleted: (at-dron dron1 refugio8)
   added: (at-dron dron1 refugio15)
   goals met: 6 of 32
33. (leave box14 refugio15 dron1-der dron1 person17 comida)
   deleted: (carrying dron1 dron1-der box14) (box-has box14 comida)
   added: (at-box box14 refugio15) (free dron1-der) (person-has person17 comida)
   goals met: 7 of 32
34. (move refugio15 deposito dron1)
   deleted: (at-dron dron1 refugio15)
   added: (at-dron dron1 deposito)
   goals met: 7 of 32
35. (pick box13 deposito dron1-der dron1)
   deleted: (at-box box13 deposito) (free dron1-der)
   added: (carrying dron1 dron1-der box13)
   goals met: 7 of 32
36. (move deposito refugio8 dron1)
   deleted: (at-dron dron1 deposito)
   added: (at-dron dron1 refugio8)
   goals met: 7 of 32
37. (move refugio8 refugio24 dron1)
   deleted: (at-dron dron1 refugio8)
   added: (at-dron dron1 refugio24)
   goals met: 7 of 32
38. (leave box31 refugio24 dron1-izq dron1 person20 medicina)
   deleted: (carrying dron1 dron1-izq box31) (box-has box31 medicina)
   added: (at-box box31 refugio24) (free dron1-izq) (person-has person20 medicina)
   goals met: 8 of 32
39. (move refugio24 deposito dron1)
   deleted: (at-dron dron1 refugio24)
   added: (at-dron dron1 deposito)
   goals met: 8 of 32
40. (pick box30 deposito dron1-izq dron1)
   deleted: (at-box box30 deposito) (free dron1-izq)
   added: (carrying dron1 dron1-izq box30)
   goals met: 8 of 32
41. (move deposito refugio8 dron1)
   deleted: (at-dron dron1 deposito)
   added: (at-dron dron1 refugio8)
   goals met: 8 of 32
42. (move refugio8 refugio11 dron1)
   deleted: (at-dron dron1 refugio8)
   added: (at-dron dron1 refugio11)
   goals met: 8 of 32
43. (leave box13 refugio11 dron1-der dron1 person22 comida)
   deleted: (carrying dron1 dron1-der box13) (box-has box13 comida)
   added: (at-box box13 refugio11) (free dron1-der) (person-has person22 comida)
   goals met: 9 of 32
44. (move refugio11 deposito dron1)
   deleted: (at-dron dron1 refugio11)
   added: (at-dron dron1 deposito)
   goals met: 9 of 32
45. (pick box12 deposito dron1-der dron1)
   deleted: (at-box box12 deposito) (free dron1-der)
   added: (carrying dron1 dron1-der box12)
   goals met: 9 of 32
46. (move deposito refugio8 dron1)
   deleted: (at-dron dron1 deposito)
   added: (at-dron dron1 refugio8)
   goals met: 9 of 32
47. (move refugio8 refugio10 dron1)
   deleted: (at-dron dron1 refugio8)
   added: (at-dron dron1 refugio10)
   goals met: 9 of 32
48. (leave box30 refugio10 dron1-izq dron1 person28 medicina)
   deleted: (carrying dron1 dron1-izq box30) (box-has box30 medicina)
   added: (at-box box30 refugio10) (free dron1-izq) (person-has person28 medicina)
   goals met: 10 of 32
49. (move refugio10 deposito dron1)
   deleted: (at-dron dron1 refugio10)
   added: (at-dron dron1 deposito)
   goals met: 10 of 32
50. (pick box29 deposito dron1-izq dron1)
   deleted: (at-box box29 deposito) (free dron1-izq)
   added: (carrying dron1 dron1-izq box29)
   goals met: 10 of 32
51. (move deposito refugio8 dron1)
   deleted: (at-dron dron1 deposito)
   added: (at-dron dron1 refugio8)
   goals met: 10 of 32
52. (move refugio8 refugio1 dron1)
   deleted: (at-dron dron1 refugio8)
   added: (at-dron dron1 refugio1)
   goals met: 10 of 32
53. (leave box29 refugio1 dron1-izq dron1 person30 medicina)
   deleted: (carrying dron1 dron1-izq box29) (box-has box29 medicina)
   added: (at-box box29 refugio1) (free dron1-izq) (person-has person30 medicina)
   goals met: 11 of 32
54. (move refugio1 deposito dron1)
   deleted: (at-dron dron1 refugio1)
   added: (at-dron dron1 deposito)
   goals met: 11 of 32
55. (pick box28 deposito dron1-izq dron1)
   deleted: (at-box box28 deposito) (free dron1-izq)
   added: (carrying dron1 dron1-izq box28)
   goals met: 11 of 32
56. (move deposito refugio8 dron1)
   deleted: (at-dron dron1 deposito)
   added: (at-dron dron1 refugio8)
   goals met: 11 of 32
57. (leave box12 refugio8 dron1-der dron1 person2 comida)
   deleted: (carrying dron1 dron1-der box12) (box-has box12 comida)
   added: (at-box box12 refugio8) (free dron1-der) (person-has person2 comida)
   goals met: 12 of 32
58. (move refugio8 deposito dron1)
   deleted: (at-dron dron1 refugio8)
   added: (at-dron dron1 deposito)
   goals met: 12 of 32
59. (pick box11 deposito dron1-der dron1)
   deleted: (at-box box11 deposito) (free dron1-der)
   added: (carrying dron1 dron1-der box11)
   goals met: 12 of 32
60. (move deposito refugio8 dron1)
   deleted: (at-dron dron1 deposito)
   added: (at-dron dron1 refugio8)
   goals met: 12 of 32
61. (leave box28 refugio8 dron1-izq dron1 person2 medicina)
   deleted: (carrying dron1 dron1-izq box28) (box-has box28 medicina)
   added: (at-box box28 refugio8) (free dron1-izq) (person-has person2 medicina)
   goals met: 13 of 32
62. (move refugio8 deposito dron1)
   deleted: (at-dron dron1 refugio8)
   added: (at-dron dron1 deposito)
   goals met: 13 of 32
63. (pick box27 deposito dron1-izq dron1)
   deleted: (at-box box27 deposito) (free dron1-izq)
   added: (carrying dron1 dron1-izq box27)
   goals met: 13 of 32
64. (move deposito refugio8 dron1)
   deleted: (at-dron dron1 deposito)
   added: (at-dron dron1 refugio8)
   goals met: 13 of 32
65. (leave box11 refugio8 dron1-der dron1 person9 comida)
   deleted: (carrying dron1 dron1-der box11) (box-has box11 comida)
   added: (at-box box11 refugio8) (free dron1-der) (person-has person9 comida)
   goals met: 14 of 32
66. (move refugio8 deposito dron1)
   deleted: (at-dron dron1 refugio8)
   added: (at-dron dron1 deposito)
   goals met: 14 of 32
67. (pick box10 deposito dron1-der dron1)
   deleted: (at-box box10 deposito) (free dron1-der)
   added: (carrying dron1 dron1-der box10)
   goals met: 14 of 32
68. (move deposito refugio7 dron1)
   deleted: (at-dron dron1 deposito)
   added: (at-dron dron1 refugio7)
   goals met: 14 of 32
69. (leave box10 refugio7 dron1-der dron1 person13 comida)
   deleted: (carrying dron1 dron1-der box10) (box-has box10 comida)
   added: (at-box box10 refugio7) (free dron1-der) (person-has person13 comida)
   goals met: 15 of 32
70. (move refugio7 deposito dron1)
   deleted: (at-dron dron1 refugio7)
   added: (at-dron dron1 deposito)
   goals met: 15 of 32
71. (pick box9 deposito dron1-der dron1)
   deleted: (at-box box9 deposito) (free dron1-der)
   added: (carrying dron1 dron1-der box9)
   goals met: 15 of 32
72. (move deposito refugio7 dron1)
   deleted: (at-dron dron1 deposito)
   added: (at-dron dron1 refugio7)
   goals met: 15 of 32
73. (leave box27 refugio7 dron1-izq dron1 person13 medicina)
   deleted: (carrying dron1 dron1-izq box27) (box-has box27 medicina)
   added: (at-box box27 refugio7) (free dron1-izq) (person-has person13 medicina)
   goals met: 16 of 32
74. (move refugio7 deposito dron1)
   deleted: (at-dron dron1 refugio7)
   added: (at-dron dron1 deposito)
   goals met: 16 of 32
75. (pick box26 deposito dron1-izq dron1)
   deleted: (at-box box26 deposito) (free dron1-izq)
   added: (carrying dron1 dron1-izq box26)
   goals met: 16 of 32
76. (move deposito refugio14 dron1)
   deleted: (at-dron dron1 deposito)
   added: (at-dron dron1 refugio14)
   goals met: 16 of 32
77. (leave box9 refugio14 dron1-der dron1 person14 comida)
   deleted: (carrying dron1 dron1-der box9) (box-has box9 comida)
   added: (at-box box9 refugio14) (free dron1-der) (person-has person14 comida)
   goals met: 17 of 32
78. (move refugio14 deposito dron1)
   deleted: (at-dron dron1 refugio14)
   added: (at-dron dron1 deposito)
   goals met: 17 of 32
79. (pick box8 deposito dron1-der dron1)
   deleted: (at-box box8 deposito) (free dron1-der)
   added: (carrying dron1 dron1-der box8)
   goals met: 17 of 32
80. (move deposito refugio14 dron1)
   deleted: (at-dron dron1 deposito)
   added: (at-dron dron1 refugio14)
   goals met: 17 of 32
81. (leave box26 refugio14 dron1-izq dron1 person14 medicina)
   deleted: (carrying dron1 dron1-izq box26) (box-has box26 medicina)
   added: (at-box box26 refugio14) (free dron1-izq) (person-has person14 medicina)
   goals met: 18 of 32
82. (move refugio14 deposito dron1)
   deleted: (at-dron dron1 refugio14)
   added: (at-dron dron1 deposito)
   goals met: 18 of 32
83. (pick box25 deposito dron1-izq dron1)
   deleted: (at-box box25 deposito) (free dron1-izq)
   added: (carrying dron1 dron1-izq box25)
   goals met: 18 of 32
84. (move deposito refugio19 dron1)
   deleted: (at-dron dron1 deposito)
   added: (at-dron dron1 refugio19)
   goals met: 18 of 32
85. (leave box8 refugio19 dron1-der dron1 person16 comida)
   deleted: (carrying dron1 dron1-der box8) (box-has box8 comida)
   added: (at-box box8 refugio19) (free dron1-der) (person-has person16 comida)
   goals met: 19 of 32
86. (move refugio19 deposito dron1)
   deleted: (at-dron dron1 refugio19)
   added: (at-dron dron1 deposito)
   goals met: 19 of 32
87. (pick box7 deposito dron1-der dron1)
   deleted: (at-box box7 deposito) (free dron1-der)
   added: (carrying dron1 dron1-der box7)
   goals met: 19 of 32
88. (move deposito refugio19 dron1)
   deleted: (at-dron dron1 deposito)
   added: (at-dron dron1 refugio19)
   goals met: 19 of 32
89. (leave box25 refugio19 dron1-izq dron1 person16 medicina)
   deleted: (carrying dron1 dron1-izq box25) (box-has box25 medicina)
   added: (at-box box25 refugio19) (free dron1-izq) (person-has person16 medicina)
   goals met: 20 of 32
90. (move refugio19 deposito dron1)
   deleted: (at-dron dron1 refugio19)
   added: (at-dron dron1 deposito)
   goals met: 20 of 32
91. (pick box24 deposito dron1-izq dron1)
   deleted: (at-box box24 deposito) (free dron1-izq)
   added: (carrying dron1 dron1-izq box24)
   goals met: 20 of 32
92. (move deposito refugio22 dron1)
   deleted: (at-dron dron1 deposito)
   added: (at-dron dron1 refugio22)
   goals met: 20 of 32
93. (leave box7 refugio22 dron1-der dron1 person3 comida)
   deleted: (carrying dron1 dron1-der box7) (box-has box7 comida)
   added: (at-box box7 refugio22) (free dron1-der) (person-has person3 comida)
   goals met: 21 of 32
94. (move refugio22 deposito dron1)
   deleted: (at-dron dron1 refugio22)
   added: (at-dron dron1 deposito)
   goals met: 21 of 32
95. (pick box6 deposito dron1-der dron1)
   deleted: (at-box box6 deposito) (free dron1-der)
   added: (carrying dron1 dron1-der box6)
   goals met: 21 of 32
96. (move deposito refugio22 dron1)
   deleted: (at-dron dron1 deposito)
   added: (at-dron dron1 refugio22)
   goals met: 21 of 32
97. (leave box6 refugio22 dron1-der dron1 person19 comida)
   deleted: (carrying dron1 dron1-der box6) (box-has box6 comida)
   added: (at-box box6 refugio22) (free dron1-der) (person-has person19 comida)
   goals met: 22 of 32
98. (move refugio22 deposito dron1)
   deleted: (at-dron dron1 refugio22)
   added: (at-dron dron1 deposito)
   goals met: 22 of 32
99. (pick box5 deposito dron1-der dron1)
   deleted: (at-box box5 deposito) (free dron1-der)
   added: (carrying dron1 dron1-der box5)
   goals met: 22 of 32
100. (move deposito refugio22 dron1)
   deleted: (at-dron dron1 deposito)
   added: (at-dron dron1 refugio22)
   goals met: 22 of 32
101. (leave box24 refugio22 dron1-izq dron1 person19 medicina)
   deleted: (carrying dron1 dron1-izq box24) (box-has box24 medicina)
   added: (at-box box24 refugio22) (free dron1-izq) (person-has person19 medicina)
   goals met: 23 of 32
102. (move refugio22 deposito dron1)
   deleted: (at-dron dron1 refugio22)
   added: (at-dron dron1 deposito)
   goals met: 23 of 32
103. (pick box23 deposito dron1-izq dron1)
   deleted: (at-box box23 deposito) (free dron1-izq)
   added: (carrying dron1 dron1-izq box23)
   goals met: 23 of 32
104. (move deposito refugio20 dron1)
   deleted: (at-dron dron1 deposito)
   added: (at-dron dron1 refugio20)
   goals met: 23 of 32
105. (leave box5 refugio20 dron1-der dron1 person23 comida)
   deleted: (carrying dron1 dron1-der box5) (box-has box5 comida)
   added: (at-box box5 refugio20) (free dron1-der) (person-has person23 comida)
   goals met: 24 of 32
106. (move refugio20 deposito dron1)
   deleted: (at-dron dron1 refugio20)
   added: (at-dron dron1 deposito)
   goals met: 24 of 32
107. (pick box4 deposito dron1-der dron1)
   deleted: (at-box box4 deposito) (free dron1-der)
   added: (carrying dron1 dron1-der box4)
   goals met: 24 of 32
108. (move deposito refugio20 dron1)
   deleted: (at-dron dron1 deposito)
   added: (at-dron dron1 refugio20)
   goals met: 24 of 32
109. (leave box23 refugio20 dron1-izq dron1 person23 medicina)
   deleted: (carrying dron1 dron1-izq box23) (box-has box23 medicina)
   added: (at-box box23 refugio20) (free dron1-izq) (person-has person23 medicina)
   goals met: 25 of 32
110. (move refugio20 deposito dron1)
   deleted: (at-dron dron1 refugio20)
   added: (at-dron dron1 deposito)
   goals met: 25 of 32
111. (pick box22 deposito dron1-izq dron1)
   deleted: (at-box box22 deposito) (free dron1-izq)
   added: (carrying dron1 dron1-izq box22)
   goals met: 25 of 32
112. (move deposito refugio12 dron1)
   deleted: (at-dron dron1 deposito)
   added: (at-dron dron1 refugio12)
   goals met: 25 of 32
113. (leave box4 refugio12 dron1-der dron1 person5 comida)
   deleted: (carrying dron1 dron1-der box4) (box-has box4 comida)
   added: (at-box box4 refugio12) (free dron1-der) (person-has person5 comida)
   goals met: 26 of 32
114. (move refugio12 deposito dron1)
   deleted: (at-dron dron1 refugio12)
   added: (at-dron dron1 deposito)
   goals met: 26 of 32
115. (pick box3 deposito dron1-der dron1)
   deleted: (at-box box3 deposito) (free dron1-der)
   added: (carrying dron1 dron1-der box3)
   goals met: 26 of 32
116. (move deposito refugio12 dron1)
   deleted: (at-dron dron1 deposito)
   added: (at-dron dron1 refugio12)
   goals met: 26 of 32
117. (leave box3 refugio12 dron1-der dron1 person18 comida)
   deleted: (carrying dron1 dron1-der box3) (box-has box3 comida)
   added: (at-box box3 refugio12) (free dron1-der) (person-has person18 comida)
   goals met: 27 of 32
118. (move refugio12 deposito dron1)
   deleted: (at-dron dron1 refugio12)
   added: (at-dron dron1 deposito)
   goals met: 27 of 32
119. (pick box2 deposito dron1-der dron1)
   deleted: (at-box box2 deposito) (free dron1-der)
   added: (carrying dron1 dron1-der box2)
   goals met: 27 of 32
120. (move deposito refugio12 dron1)
   deleted: (at-dron dron1 deposito)
   added: (at-dron dron1 refugio12)
   goals met: 27 of 32
121. (leave box22 refugio12 dron1-izq dron1 person26 medicina)
   deleted: (carrying dron1 dron1-izq box22) (box-has box22 medicina)
   added: (at-box box22 refugio12) (free dron1-izq) (person-has person26 medicina)
   goals met: 28 of 32
122. (move refugio12 deposito dron1)
   deleted: (at-dron dron1 refugio12)
   added: (at-dron dron1 deposito)
   goals met: 28 of 32
123. (pick box21 deposito dron1-izq dron1)
   deleted: (at-box box21 deposito) (free dron1-izq)
   added: (carrying dron1 dron1-izq box21)
   goals met: 28 of 32
124. (move deposito refugio16 dron1)
   deleted: (at-dron dron1 deposito)
   added: (at-dron dron1 refugio16)
   goals met: 28 of 32
125. (leave box2 refugio16 dron1-der dron1 person24 comida)
   deleted: (carrying dron1 dron1-der box2) (box-has box2 comida)
   added: (at-box box2 refugio16) (free dron1-der) (person-has person24 comida)
   goals met: 29 of 32
126. (move refugio16 deposito dron1)
   deleted: (at-dron dron1 refugio16)
   added: (at-dron dron1 deposito)
   goals met: 29 of 32
127. (pick box1 deposito dron1-der dron1)
   deleted: (at-box box1 deposito) (free dron1-der)
   added: (carrying dron1 dron1-der box1)
   goals met: 29 of 32
128. (move deposito refugio16 dron1)
   deleted: (at-dron dron1 deposito)
   added: (at-dron dron1 refugio16)
   goals met: 29 of 32
129. (leave box1 refugio16 dron1-der dron1 person31 comida)
   deleted: (carrying dron1 dron1-der box1) (box-has box1 comida)
   added: (at-box box1 refugio16) (free dron1-der) (person-has person31 comida)
   goals met: 30 of 32
130. (leave box21 refugio16 dron1-izq dron1 person24 medicina)
   deleted: (carrying dron1 dron1-izq box21) (box-has box21 medicina)
   added: (at-box box21 refugio16) (free dron1-izq) (person-has person24 medicina)
   goals met: 31 of 32
131. (move refugio16 deposito dron1)
   deleted: (at-dron dron1 refugio16)
   added: (at-dron dron1 deposito)
   goals met: 31 of 32
132. (pick box20 deposito dron1-der dron1)
   deleted: (at-box box20 deposito) (free dron1-der)
   added: (carrying dron1 dron1-der box20)
   goals met: 31 of 32
133. (move deposito refugio16 dron1)
   deleted: (at-dron dron1 deposito)
   added: (at-dron dron1 refugio16)
   goals met: 31 of 32
134. (leave box20 refugio16 dron1-der dron1 person31 medicina)
   deleted: (carrying dron1 dron1-der box20) (box-has box20 medicina)
   added: (at-box box20 refugio16) (free dron1-der) (person-has person31 medicina)
   goals met: 32 of 32
